{
    "city": [
        {
            "name": "Toshkent",
            "region": "Toshkent viloyati",
            "type": "city",
            "description": "Toshkent – O‘zbekiston poytaxti, Markaziy Osiyodagi eng yirik shahar. Toshkent, O‘zbekistonning ko‘plab shaharlari singari, qadimiy shahardir. Uning yoshi 2000 yildan oshadi. Yozma manbalarda Toshkent tarixi qadimgi davrlarga borib taqaladi. Bu joy mahalliy talaffuzga ko‘ra Choch deb nomlangan. Asosiy shahar Choch, ya’ni  Chochkent yoki Shoshkent deb nomlangan. Keyinchalik bu so‘zning ma’nosi o‘zgardi va Toshkentga aylandi.Taxminan miloddan avvalgi 2-asrning oxiri – 1-asrning boshlarida Xitoy solnomalarida Chirchik vodiysida Yuni viloyatining shahri borligi haqida ma’lumotlar mavjud bo‘lgan. Olimlarning fikricha, Yuni shahri hozirgi Toshkent hududida joylashgan bo‘lgan.VI-VII asrlarda Toshkent hududi Choch davlatining tarkibiga kirgan bo‘lib, bu yerda turkiy hokimlar yashagan. 713-yilda birinchi arab qo‘shinlari Shoshga kirdi. Istilo juda zaif edi va shundan keyin o‘nlab yillar davomida Shoshni maliklar boshqargan. Faqat 751-yilda arablar va xitoylar o‘rtasidagi katta jangdan so‘ng, Shoshni egallashga harakat qilgan arablar o‘z g‘alabasini mustahkamladi. O‘sha davrdan Toshkentda bitta noyob yodgorlik – Hazrati Imom maqbarasi saqlanib qolgan.IX-X asrlarga kelib, shahar savdo va hunarmandchilik markaziga aylandi. Bu yerda tepaliklarda joylashgan qal’a va ichki shahar – shahriston qurilgan bo‘lib, hozir u “Chorsu” eski bozorining markazidir. Qal’aning devorlari ortida saroy va qamoqxona bor edi. Qadimgi qal’a devorining minora qismi Toshkent sirki yonidan yaqin vaqtgacha ko‘rinib turardi. Qal’aning bitta darvozasi shahar chekkasi – rabotga, boshqasi shahristonga olib borardi. Oxirgisi mustaqil devor sifatida topilib, uchta darvozaga ega bo‘lgan.1220-yilda Chingizxon boshchiligidagi mo‘g‘ullar O‘rta Osiyoni zabt etdilar. Mo‘g‘ullar istilosi paytida mo‘g‘ullar va yangi turkiy ko‘chmanchilar mahalliy aholi bilan aralashib ketdi.14-asr oxiri va 15-asr boshlarida Toshkent bu kurashning tavsifida juda tez-tez tilga olinib, uning natijasida Amir Temur davlati avval rivojlanib, keyinchalik parchalanib ketadi. Toshkentda saqlanib qolgan ba’zi me'morchilik yodgorliklari, masalan, Shayxontohur mozori yonidagi inshootlar majmuasi ushbu davr bilan bog‘liqdir. Ular orasida Yunusxonning maqbarasi bo‘lib, uning ichki qismi o‘ymakor, tosh yarim ustunlari bilan ko‘rkam qilib ishlangan.XVI asr boshlarida Toshkent Shayboniyxon tomonidan asos solingan davlat tarkibiga kirdi. XVI asrning ikkinchi yarmida buxorolik Abdullaxon Toshkentni qamal qilishni boshladi va uni egallab oldi. 1723-yilda Toshkent qalmiqlarga bo‘ysundirildi.XVIII asrning ikkinchi yarmida shahar yana Buxoroning qudratini tan ola boshladi. Bu davrda Toshkent to‘rt qismga bo‘lingan edi. Shahar hokimlaridan biri Yunus boshqa hokimlarga qarshi kurashga qo‘shiladi va hokimiyatni o‘z qo‘liga oladi. Yunus davrida Toshkent shahri devor bilan o‘ralgan edi, chunki shahar doimo Qo‘qon xonligi bilan kurashga dosh berishga majbur edi. Ammo 1810-yilda Toshkent birinchi bo‘lib Qo‘qon xonligi, keyin 1865-yilda rus qo‘shinlari tomonidan egallab olindi.20-asrning boshlarida shahar o‘zgara boshladi, chunki  o‘ziga xos \"Yangi shahar\" barpo etildi. Toshkent ikki –  eski va yangi qismlarga bo‘lindi. Biroq 1940-yilga kelib, rejalashtirish loyihasi tuzilib, unga ko‘ra, shaharning ikki qismini birlashtirish ko‘zda tutilgandi. Qayta qurish ishlari natijasida rivojlangan infratuzilmaga ega bo‘lgan ixcham hudud yuzaga keldi. Shahar obodonlashtirildi, taassurot qoldiradigan me’moriy inshootlar, xozirgi kungacha ko‘rish mumkin bo‘lgan xiyobonlar, istirohat bog‘lari barpo etildi.So‘nggi yillarda Toshkent yangilanish va qayta qurishni boshdan kechirdi. Bugungi Toshkent – bu qadimiy va boy tarixga ega zamonaviy industrial va iqtisodiy megapolisdir.",
            "image": "tashkent"
        },
        {
            "name": "Samarqand",
            "region": "Samarqand viloyati",
            "type": "city",
            "description": "Samarqand sayyoramizdagi eng qadimiy shaharlardan biri bo‘lib, Rim va Afina bilan tengdoshdir. U 2750 yoshdan oshgan. Shahar har doim haqiqiy sharqona mehmondo‘stlikning chinakam namunasi bo‘lgani bilan ajralib turgan. Bu yerda bir necha millat vakillari doimo muammosiz yashab kelgan. Samarqandni odatda \"Sharqiy Bobil\" deb atashadi.Unda go‘yo ulkan oynadagidek yo‘l aks etadi. Ko‘p avlodlar bosib o‘tgan yo‘l. Shaharning boy voqealari, yuksalishlar va pasayishlar, qimmatbaho topilmalar va eksponatlar, qadimiy obidalar dastlabki odamlar bu hududda ming yillar oldin yashay boshlaganliklarini tasdiqlashga imkon beradi.Qadimgi afsonaga ko‘ra, Samarqand shahri tashkil etilganida (miloddan avvalgi VIII asrda) Zarafshon tog‘laridan qoplon kelib, shahar qurilishini ma’qullagan ekan. O‘shandan beri Samarqandda odamlar o‘zlarini qoplon bilan bog‘lashadi – ular xuddi o‘shanday mag‘rur, xuddi o‘shanday qat’iyatli va xuddi o‘shanday saxiydirlar.Samarqand nomi so‘g‘d tilidagi Smr’kand so’zidan kelib chiqib, \"tosh qal’a\" yoki \"tosh shahar\" degan ma’noni anglatadi. Qadimgi davrlarda Samarqand eng qadimiy So‘g‘diyona davlatining poytaxti bo‘lgan va Afrosiyob deb nomlangan. Qadimgi yunonlar orasida va Rimda shahar Marakanda nomi bilan tanilgan. Iskandar Maqduniy davrida ham Samarqand obodonlashtirilib, ancha rivojlangan shahar bo‘lgan.Ilk o‘rta asrlarda Samarqand Turk xoqonligi tarkibiga kirgan. 712-yilda shahar Qutayba ibn Muslim boshchiligidagi arablar tomonidan bosib olinib, Movarounnahr va Katta Xurosonning markaziga aylangan.IX asrda Samarqand Somoniylar davlatining tarkibiga, X asr oxirida esa Qoraxoniylar davlatining tarkibiga kirgan. Bu davrda Samarqandda ulkan me’moriy inshootlar qurilgan bo‘lib, ularning ko‘p qismi, afsuski, Chingizxon tomonidan vayron qilingan. Keyin Samarqand mo‘g‘ullar istilosi natijasida vayron bo‘lgan Xorazmshohlar davlatining tarkibiga kirdi.Amir Temur hokimiyat tepasiga kelganida Samarqandda juda katta o‘zgarishlar ro‘y berdi. Shahar yana poytaxtga aylandi, vayron bo‘lgan binolarni tiklash ishlari boshlandi va Samarqand yana o‘zining avvalgi ulug‘vor holatiga qaytdi. Temuriylar davrida Samarqand faol rivojlanib bordi, dunyoning turli mamlakatlaridan olimlar va san’atkorlar bu yerga kelishga harakat qilishdi. Shaharda ilm-fan, ta’lim va madaniyatni rivojlantirish uchun barcha sharoitlar yaratildi.XVI asrda Temuriylardan keyin Shayboniylar sulolasi keldi va shahar Buxoro xonligiga kirdi. XVIII asrdan boshlab Samarqandni Ashtarxoniylar boshqargan, Buxoro xonligi esa Buxoro amirligiga aylantirilgan. Uzoq davom etgan o‘zaro ichki nizolar tufayli Samarqand iqtisodiy inqirozga yuz tutgan. Shaharni tiklashga birinchi urinishlar 18-asrning o‘rtalarida Mang‘itlar sulolasi tomonidan amalga oshirilgan.1868-yilda shahar rus qo‘shinlari tomonidan bosib olindi. Bir yil o‘tgach, Samarqand shahri tashkil etilgan Samarqand viloyatining ma’muriy markaziga aylandi. Qizig‘i shundaki, 1925-1930-yillarda Samarqand qisqa vaqt yana poytaxt bo‘ldi.Bugungi kunda Samarqand eng go‘zal va madaniyatga boy shahar bo‘lib qolmoqda. Boy tarixiga qaramay, shahar o‘ziga xosligi va betakror qiyofasini yo‘qotmagan.Samarqandliklar mohir hunarmandlardir. Ular butun hayoti davomida qo‘shni xalqlarni o‘zlarining hunarlari, mahoratlari va ijodlari bilan hayratda qoldirganlar. Samarqandni Markaziy Osiyo xalqlari madaniyatining bebaho xazinasi deb atashadi. Bu yerda O‘rta asr me’morchiligining eng buyuk yodgorliklari – g‘oyat go‘zal me’moriy shakllar va rasmlar saqlanib qolgan bo‘lib, ularning har biri alohida e’tiborga loyiqdir. Biroq, Fred Barnard aytganidek: \"Yuz marta eshitgandan ko‘ra, bir marta ko‘rgan afzaldir.\" Shuning uchun Sharq Gavhari va qalb bog‘i – Samarqandga xush kelibsiz!",
            "image": "samarkand"
        }
    ]
}