{
    "city": [
        {
            "name": "Toshkent",
            "region": "Toshkent viloyati",
            "description": "Toshkent – O‘zbekiston poytaxti, Markaziy Osiyodagi eng yirik shahar. Toshkent, O‘zbekistonning ko‘plab shaharlari singari, qadimiy shahardir. Uning yoshi 2000 yildan oshadi. Yozma manbalarda Toshkent tarixi qadimgi davrlarga borib taqaladi. Bu joy mahalliy talaffuzga ko‘ra Choch deb nomlangan. Asosiy shahar Choch, ya’ni  Chochkent yoki Shoshkent deb nomlangan. Keyinchalik bu so‘zning ma’nosi o‘zgardi va Toshkentga aylandi.Taxminan miloddan avvalgi 2-asrning oxiri – 1-asrning boshlarida Xitoy solnomalarida Chirchik vodiysida Yuni viloyatining shahri borligi haqida ma’lumotlar mavjud bo‘lgan. Olimlarning fikricha, Yuni shahri hozirgi Toshkent hududida joylashgan bo‘lgan.VI-VII asrlarda Toshkent hududi Choch davlatining tarkibiga kirgan bo‘lib, bu yerda turkiy hokimlar yashagan. 713-yilda birinchi arab qo‘shinlari Shoshga kirdi. Istilo juda zaif edi va shundan keyin o‘nlab yillar davomida Shoshni maliklar boshqargan. Faqat 751-yilda arablar va xitoylar o‘rtasidagi katta jangdan so‘ng, Shoshni egallashga harakat qilgan arablar o‘z g‘alabasini mustahkamladi. O‘sha davrdan Toshkentda bitta noyob yodgorlik – Hazrati Imom maqbarasi saqlanib qolgan.IX-X asrlarga kelib, shahar savdo va hunarmandchilik markaziga aylandi. Bu yerda tepaliklarda joylashgan qal’a va ichki shahar – shahriston qurilgan bo‘lib, hozir u “Chorsu” eski bozorining markazidir. Qal’aning devorlari ortida saroy va qamoqxona bor edi. Qadimgi qal’a devorining minora qismi Toshkent sirki yonidan yaqin vaqtgacha ko‘rinib turardi. Qal’aning bitta darvozasi shahar chekkasi – rabotga, boshqasi shahristonga olib borardi. Oxirgisi mustaqil devor sifatida topilib, uchta darvozaga ega bo‘lgan.1220-yilda Chingizxon boshchiligidagi mo‘g‘ullar O‘rta Osiyoni zabt etdilar. Mo‘g‘ullar istilosi paytida mo‘g‘ullar va yangi turkiy ko‘chmanchilar mahalliy aholi bilan aralashib ketdi.14-asr oxiri va 15-asr boshlarida Toshkent bu kurashning tavsifida juda tez-tez tilga olinib, uning natijasida Amir Temur davlati avval rivojlanib, keyinchalik parchalanib ketadi. Toshkentda saqlanib qolgan ba’zi me'morchilik yodgorliklari, masalan, Shayxontohur mozori yonidagi inshootlar majmuasi ushbu davr bilan bog‘liqdir. Ular orasida Yunusxonning maqbarasi bo‘lib, uning ichki qismi o‘ymakor, tosh yarim ustunlari bilan ko‘rkam qilib ishlangan.XVI asr boshlarida Toshkent Shayboniyxon tomonidan asos solingan davlat tarkibiga kirdi. XVI asrning ikkinchi yarmida buxorolik Abdullaxon Toshkentni qamal qilishni boshladi va uni egallab oldi. 1723-yilda Toshkent qalmiqlarga bo‘ysundirildi.XVIII asrning ikkinchi yarmida shahar yana Buxoroning qudratini tan ola boshladi. Bu davrda Toshkent to‘rt qismga bo‘lingan edi. Shahar hokimlaridan biri Yunus boshqa hokimlarga qarshi kurashga qo‘shiladi va hokimiyatni o‘z qo‘liga oladi. Yunus davrida Toshkent shahri devor bilan o‘ralgan edi, chunki shahar doimo Qo‘qon xonligi bilan kurashga dosh berishga majbur edi. Ammo 1810-yilda Toshkent birinchi bo‘lib Qo‘qon xonligi, keyin 1865-yilda rus qo‘shinlari tomonidan egallab olindi.20-asrning boshlarida shahar o‘zgara boshladi, chunki  o‘ziga xos \"Yangi shahar\" barpo etildi. Toshkent ikki –  eski va yangi qismlarga bo‘lindi. Biroq 1940-yilga kelib, rejalashtirish loyihasi tuzilib, unga ko‘ra, shaharning ikki qismini birlashtirish ko‘zda tutilgandi. Qayta qurish ishlari natijasida rivojlangan infratuzilmaga ega bo‘lgan ixcham hudud yuzaga keldi. Shahar obodonlashtirildi, taassurot qoldiradigan me’moriy inshootlar, xozirgi kungacha ko‘rish mumkin bo‘lgan xiyobonlar, istirohat bog‘lari barpo etildi.So‘nggi yillarda Toshkent yangilanish va qayta qurishni boshdan kechirdi. Bugungi Toshkent – bu qadimiy va boy tarixga ega zamonaviy industrial va iqtisodiy megapolisdir.",
            "image": "city/toshkent"
        },
        {
            "name": "Samarqand",
            "region": "Samarqand viloyati",
            "description": "Samarqand sayyoramizdagi eng qadimiy shaharlardan biri bo‘lib, Rim va Afina bilan tengdoshdir. U 2750 yoshdan oshgan. Shahar har doim haqiqiy sharqona mehmondo‘stlikning chinakam namunasi bo‘lgani bilan ajralib turgan. Bu yerda bir necha millat vakillari doimo muammosiz yashab kelgan. Samarqandni odatda \"Sharqiy Bobil\" deb atashadi.Unda go‘yo ulkan oynadagidek yo‘l aks etadi. Ko‘p avlodlar bosib o‘tgan yo‘l. Shaharning boy voqealari, yuksalishlar va pasayishlar, qimmatbaho topilmalar va eksponatlar, qadimiy obidalar dastlabki odamlar bu hududda ming yillar oldin yashay boshlaganliklarini tasdiqlashga imkon beradi.Qadimgi afsonaga ko‘ra, Samarqand shahri tashkil etilganida (miloddan avvalgi VIII asrda) Zarafshon tog‘laridan qoplon kelib, shahar qurilishini ma’qullagan ekan. O‘shandan beri Samarqandda odamlar o‘zlarini qoplon bilan bog‘lashadi – ular xuddi o‘shanday mag‘rur, xuddi o‘shanday qat’iyatli va xuddi o‘shanday saxiydirlar.Samarqand nomi so‘g‘d tilidagi Smr’kand so’zidan kelib chiqib, \"tosh qal’a\" yoki \"tosh shahar\" degan ma’noni anglatadi. Qadimgi davrlarda Samarqand eng qadimiy So‘g‘diyona davlatining poytaxti bo‘lgan va Afrosiyob deb nomlangan. Qadimgi yunonlar orasida va Rimda shahar Marakanda nomi bilan tanilgan. Iskandar Maqduniy davrida ham Samarqand obodonlashtirilib, ancha rivojlangan shahar bo‘lgan.Ilk o‘rta asrlarda Samarqand Turk xoqonligi tarkibiga kirgan. 712-yilda shahar Qutayba ibn Muslim boshchiligidagi arablar tomonidan bosib olinib, Movarounnahr va Katta Xurosonning markaziga aylangan.IX asrda Samarqand Somoniylar davlatining tarkibiga, X asr oxirida esa Qoraxoniylar davlatining tarkibiga kirgan. Bu davrda Samarqandda ulkan me’moriy inshootlar qurilgan bo‘lib, ularning ko‘p qismi, afsuski, Chingizxon tomonidan vayron qilingan. Keyin Samarqand mo‘g‘ullar istilosi natijasida vayron bo‘lgan Xorazmshohlar davlatining tarkibiga kirdi.Amir Temur hokimiyat tepasiga kelganida Samarqandda juda katta o‘zgarishlar ro‘y berdi. Shahar yana poytaxtga aylandi, vayron bo‘lgan binolarni tiklash ishlari boshlandi va Samarqand yana o‘zining avvalgi ulug‘vor holatiga qaytdi. Temuriylar davrida Samarqand faol rivojlanib bordi, dunyoning turli mamlakatlaridan olimlar va san’atkorlar bu yerga kelishga harakat qilishdi. Shaharda ilm-fan, ta’lim va madaniyatni rivojlantirish uchun barcha sharoitlar yaratildi.XVI asrda Temuriylardan keyin Shayboniylar sulolasi keldi va shahar Buxoro xonligiga kirdi. XVIII asrdan boshlab Samarqandni Ashtarxoniylar boshqargan, Buxoro xonligi esa Buxoro amirligiga aylantirilgan. Uzoq davom etgan o‘zaro ichki nizolar tufayli Samarqand iqtisodiy inqirozga yuz tutgan. Shaharni tiklashga birinchi urinishlar 18-asrning o‘rtalarida Mang‘itlar sulolasi tomonidan amalga oshirilgan.1868-yilda shahar rus qo‘shinlari tomonidan bosib olindi. Bir yil o‘tgach, Samarqand shahri tashkil etilgan Samarqand viloyatining ma’muriy markaziga aylandi. Qizig‘i shundaki, 1925-1930-yillarda Samarqand qisqa vaqt yana poytaxt bo‘ldi.Bugungi kunda Samarqand eng go‘zal va madaniyatga boy shahar bo‘lib qolmoqda. Boy tarixiga qaramay, shahar o‘ziga xosligi va betakror qiyofasini yo‘qotmagan.Samarqandliklar mohir hunarmandlardir. Ular butun hayoti davomida qo‘shni xalqlarni o‘zlarining hunarlari, mahoratlari va ijodlari bilan hayratda qoldirganlar. Samarqandni Markaziy Osiyo xalqlari madaniyatining bebaho xazinasi deb atashadi. Bu yerda O‘rta asr me’morchiligining eng buyuk yodgorliklari – g‘oyat go‘zal me’moriy shakllar va rasmlar saqlanib qolgan bo‘lib, ularning har biri alohida e’tiborga loyiqdir. Biroq, Fred Barnard aytganidek: \"Yuz marta eshitgandan ko‘ra, bir marta ko‘rgan afzaldir.\" Shuning uchun Sharq Gavhari va qalb bog‘i – Samarqandga xush kelibsiz!",
            "image": "city/samarqand"
        },
        {
            "name": "Buxoro",
            "region": "Buxoro viloyati",
            "description": "Buxoro – vohadagi shahar, cho‘lning qoq o‘rtasida joylashgan eng yirik aholi punktidir. Bir vaqtlar Buyuk Ipak yo‘lida joylashgan shahar eng qadimgilardan biri bo‘lib, uning tarixi 2500 yildan oshadi.Buxoro o‘zida qadimiy urf-odatlarning ko‘p asrlik tarixini Islom dini bilan mujassamlashtirdi. Hayratlanarli darajada donolik, muqaddaslik va ta’lim berish muhitiga ega bo‘lgan shahar. Bir marta ushbu shaharda bo‘lganingizda, o‘zingizni go‘yo boshqa dunyoda va boshqa sayyorada bo‘lgandek his etasiz. Madaniy, diniy, etnik sivilizatsiyalarning betakror aralashuvi Buxoroni unutilmas taassurotlar shahriga aylantirdi.Buxoro viloyati hududida zardushtiylar, xristianlar, yahudiylar, buddistlar yashagan. 9-asr oxirida Buxoro O‘rta Osiyodagi eng muhim Islom va madaniyat markazlaridan biriga aylandi. Bir necha asrlar davomida bu yerga sayohatchilar, ziyoratchilar, va’zxonlar, tadqiqotchilar kelishgan. Buxoro – ilmiy, diniy va falsafiy bilimlar makonidir.Bu yerda o‘z davrining din arboblari va ilg‘or insonlari yashab, tahsil olishgan: Alisher Navoiy, Abu Ali ibn Sino, Al Buxoriy va boshqalar respublikaning haqiqiy boyligiga aylangan. Ular tasavvuf ma’naviy va falsafiy ta’limotlarining eng taniqli tarafdorlari edilar. Bu zaminda ular haqida xotiralar saqlanib qolgan. Ular moddiy va nomoddiy yodgorliklarni yaratdilar, kashfiyotlar qildilar, aql bovar qilmaydigan darajada go‘zal madrasa va masjidlarini qurdilar.Birinchi tarixiy yozuvlar X asrda Narshaxiy tomonidan \"Buxoro tarixi\"da yozilgan. U o‘z asarida hozirgi kunda ham ko‘rish mumkin bo‘lgan qadimiy Ark qal’asini tasvirlab bergan. Samarqand singari Buxoro ham ko‘p asrlar davomida bitta bosqinchidan boshqasiga o‘tgan. Buxoroning har bir fuqarosi o‘z hukmdorlarini yaxshi eslaydi va biladi.Iskandar Maqduniy zabt etganidan keyin bu yerda Yunon-Baqtriya davlati shakllandi. Keyinchalik Kushon, Eftaliylar davlati, Turk xoqonligi, Arab xalifaligi, Somoniylar, Qoraxoniylar, Qoraxitoylar va Xorazmshohlar davlatlari vujudga keldi.XIII asrda mo‘g‘ullar istilosi ro‘y berdi. Afsonaga ko‘ra, Chingizxon Buxoroni zabt etib, uning asosiy minorasi Poi-Kalonni ko‘zdan kechirish uchun u tomon yo‘l olgan. U boshini ko‘taradi va jang dubulg‘asi boshidan tushib ketadi. Bosqinchi unga engashib, so‘ng jilmayib: \"Men Buxoroni zabt etdim, lekin minorasi oldida egildim\", – deb aytadi va minorani buzmaslik haqida buyruq beradi.Amir Temur va Temuriylar hukmronligi davrida Buxoro gullab-yashnadi. Bu davrda shahar jannat bog‘iga aylandi. Endi bu muqaddas Buxoro yoki Buxoroi sharifdir.XVI asrdan XX asrning boshlariga qadar Buxoro xonlikning poytaxti bo‘lgan. Bu yerda Shayboniylar va Ashtarxoniylar singari mashhur sulolalar hukmronlik qilgan. Bu vaqtda shahar o‘zining maksimal rivojlanishiga erishdi. Bu yerda ilmiy bilimlar va madaniy hayot rivojlandi. Shahar zamonaviy ko'rinishga ega bo‘ldi. Hozirgacha bizni hayratga soladigan yirik me'moriy ansambllar va majmualar qurildi.",
            "image": "city/buxoro"
        },
        {
            "name": "Xiva",
            "region": "Xorazm viloyati",
            "description": "Xivaga yetib borgach, birinchi bo‘lib ko‘radigan narsangiz bu Ichan-Qal’ani o‘rab turgan ulkan mudofaa devori bo‘ladi. Devorlari ortida haqiqiy voqelik tuyg‘usi butunlay yo‘qoladi. 25 gektar maydonda sehrli Xiva joylashgan bo‘lib, uning yoshi 2500 yildan oshadi. Shahar Buyuk Ipak yo‘li shimoliy tarmog‘ining markazi bo‘lgan edi.Xiva shahri, avvaldan me’morlar tomonidan o‘ylanganidek, o‘ziga xoslikni saqlab qolgan oz sonli shaharlardan biridir. Xiva – bu \"tirik\" yodgorlik, muzey shahardir.Afsonalardan biriga ko‘ra, qadimiy shaharga muqaddas kitoblardagi Nuhning o‘g‘li Som tomonidan asos solingan. U sahro o‘rtasida quduq qazishni boshlaydi. Yo‘ldan o‘tgan karvonlar va savdogarlar hayratlanarli darajada mazali suvni tatib ko‘rishadi va \"hevah\", ya’ni \"qanday yaxshi\" deb qo‘yishadi. Mana shunday qilib bu ajoyib shahar paydo bo‘ladi.Ulug‘vor inshootlar, o‘yma eshiklar va ustunlar, nihoyatda go‘zal binolar – bular qadimgi yashirilgan mazmunga ega kitoblardir. Xiva o‘z tarixida gullab yashnashni ham, qulashni ham boshdan kechirdi. Shahar Ahamoniylar davlati tomonidan bosib olingan. 305-yildan 995-yilgacha Xiva Xorazm davlatining tarkibiga kirgan.IX-XI asrlar davomida Xivani bir qancha qudratli sulolalar boshqargan. Shahar madaniyat va ma’rifat markazi bo‘lgan. Bu yerda astronomiya, matematika, kimyo va boshqa sohalarda ko‘plab o‘quv muassasalari va yirik ilmiy markazlar mavjud edi.1220-yilda shahar Chingizxon tomonidan vayron qilingan va uzoq vaqt davomida halokatli oqibatlardan qutula olmagan. 1511-yilda Xiva Shayboniylar davlatining tarkibiga kirdi, 1598-yilda esa shahar Xiva xonligining poytaxtiga aylandi.Eng hashamatli ulug‘vor binolarning qurilishi XVIII va XX asr boshlariga to‘g‘ri keldi. O‘shanda Xiva Qo‘ng‘irotlar sulolasi boshqaruvi ostida edi. 1763-yilda Xorazmda hokimiyatga qo‘ng‘irotlar urug‘ining yorqin vakili Muhammad Amin keldi. Uning qo‘li ostida Xiva qisqa vaqt ichida O‘rta Osiyoning ma’naviy markaziga aylandi. Uning sharofati bilan dunyo ko‘pgina qayta tiklangan binolarni, jumladan Ichan-Qal’aning devorlari va minoralari hamda mashhur Juma masjidini ko‘rdi.XIX asrning o‘rtalarida Olloqulixonning tashabbusi bilan Dishan-Qal’aning mudofaa doirasi qurilgan. Shunday qilib, Xiva o‘zida ikkita shahar: tashqi Dishan-Qal’a va ichki Ichan-Qal’ani birlashtiradi.1873-yilda Xiva rus qo‘shinlari tomonidan bosib olinadi. Xivaning barcha me’moriy yodgorliklari saqlab qolingan. Endi bu ajoyib shahar YUNESKO himoyasidadir.",
            "image": "city/xiva"
        },
        {
            "name": "Nukus",
            "region": "Qoraqalpog'iston respublikasi",
            "description": "NUKUS (qoraqalpoqcha Nekis) — Qoraqalpogʻistondagi shahar (1932-y. dan). Qoraqalpogʻiston Respublikasi poy-taxti, Respublika hududining markaziy qismida, Amudaryoning oʻng sohilida, 109 m balandlikda. Jan. va sharqda Kizilqum choʻli bilan oʻralgan, shim,da Amudaryo deltasi bilan tutashgan. Oʻrtacha t-ra iyunda 27°, yanv. da —6,9°, maksimal t-ra 46°, minimal t-ra —32°. T. y. stansiyasi. Nukusdan Toshkentgacha 1265 km. Kizketgan kanali shaharni kesib oʻtadi. Mayd. 200 km2. Aholisi 255 ming kishi (2001; 1974-y. da 88 ming; 1959-y. da 39 ming; 1939-y. da 10 ming); aso-san, qoraqalpoqlar; qozoq, oʻzbek, rus, koreys, tatar va b. ham yashaydi. Hoz. Nukus sh. oʻrnida 19-a. ning 60-y. larida Nukus ovuli mavjud boʻlgan. 1870-y. lardan Nukusda savdo-sotiq, hunarmandchilik, baliq ovlash birmuncha rivojlandi, Amudaryoning suv rejimini nazorat qiluvchi gidrologik post qurildi. Rus mustamlakachilari Nukusda 1500 kishilik garnizonni joylashtirdi. 1877-y. rus-tuzem maktabi ochildi. 20-a. ning boshlarida Nukus ovuli Amudaryoningoʻng so-hilidagi eng yirik aholi punktlaridan biriga aylandi. 1930-y. 12-noyabrda Qoraqalpogʻiston Muxtor Respublikasining markazini Toʻrtkoʻl sh. dan Nukus ovu-liga koʻchirish haqida qaror qabul qilindi. 1932-y. dan Nukusda yangi maʼmuriy binolar qurilishi boshlandi. 1939-y. Respublika maʼmuriyati Nukus shahriga koʻchib oʻtdi. Shaharning yirik avtomagistrallar tu-gunida joylashgan-ligi unda koʻp tarmoqli sanoatining tez rivojlanishiga sabab boʻldi. Nukus — Toshhovuz, Nukus — Gʻuzor avtomagistrallari xalqaro ahamiyatga ega. 345 km li Navoiy — N. temir yoʻli., N. bilan Xoʻjay-lini bogʻlaydigan koʻprik. 243 km uzunlikdagi Tuyamoʻyin — N., 112 km uzunlikdagi Nukus, Taxtakoʻpir suv uzatish tarmoutari qurildi. Respublika sanoati umumiy mahsulotining 20% ni Nukus shahar sanoat korxonalari beradi. Shaharda 50 dan ziyod sanoat korxonasi bor. Metallsozlik, qurilish materiallari, oziq-ovqat, yengil, yogʻochsozlik va poligrafiya sanoati tarmoklari mavjud. Nukusda yurilish materiallari sanoati yaxshi rivojlangan, yirik panelli uysozlik va silikat-beton z-dlari, qurilish materiallari k-tlari, gʻisht, kabel z-dlari, marmar i. ch. boʻyicha Qoraqalpoq—Italiya qoʻshma korxonasi bor. Non, goʻsht, sabzavot-konser-va, tegirmon va aralash yem k-tlari, sut-yogʻ, vino-araq va pivo-limonad z-dlari, bozorlar ishlab turibdi. Nukusda shirinmiya dorivor oʻsimligi ildizini yigʻadigan va presslaydigan tibbiy korxona mavjud. Bu korxonaning mah-suloti AK. Sh, Kanada, Yaponiya, shuningdek, Yevropa mamlakatlariga eksport qilinadi. Yengil sanoat korxonalariga Oʻzbekistonda yagona oʻtov-kigiz k-ti, tikuv va trikotaj fkalari, maishiy xizmat koʻrsatish k-ti kiradi. Shaharda oʻzbek, qoraqalpoq. va rus tillarida gazeta-kitoblar bosadigan matbaa k-ti, mebel f-kasi bor. Nukusdan turli yunalishlarda avtobuslar qatnaydi. Nukus havo yoʻllari orqali Oʻrta Osiyo va Qozogʻiston, Yevropa mamlakatlari sha-harlari, Moskva, Mineralniye Vodi, Kiyev, Volgograd, Boku, Ostona, Kiziloʻrda, Toshkent va Oʻzbekistonning barcha viloyat markazlari bilan bogʻlangan. Nukus — Qoraqalpogʻistonning ilm-fan va madaniyat markazi. Nukusda Oʻzbekiston FA, Oʻzbekiston BA larining Koraqalpogʻiston filiallari, Oʻzbekiston teri-venerologiya, onkologiya, shuningdek, chorvachilik ilmiy tadqiqot in-tlarining filiallari, pedagogika in-ti, Qoraqalpogʻiston universiteti, oʻqituvchilar malakasini oshirish in-ti va b. oliy oʻquv yurtlari ishlab turibdi. 43 umumiy taʼlim maktabi, bir qancha akademik litsey, 2 sport, 2 musiqa maktablari, 18 oʻrta maxsus bilim yurti, klub, kutubxona, sport majmui, madaniyat saroyi mavjud. Nukus telestudiyasi oʻz dasturlaridan tashqari, Moskva, Toshkent, Ash-xobod telekoʻrsatuvlarini ham olib koʻrsatadi. Shaharda 5 kasalxona, poliklinika, dorixonalar va konsultatsiya punktlari, tez yordam st-yasi bor. Ber-daq nomidagi davlat musiqali drama te-atri, filarmoniya, sanʼat muzeyi va b. muzeylar, 5 ming tomoshabinga moʻljallangan amfiteatr, markaziy stadion, 57 sport zali, botanika bogʻi mavjud.",
            "image": "city/nukus"
        },
        {
            "name": "Shahrisabz",
            "region": "Qashqadaryo viloyati",
            "description": "Shahrisabz — Amir Temur shahri, bu yerda hamma narsa u yoki bu tarzda uning nomi bilan bog’liq. Bu yerda uning otasi Muhammad Tarag’ay va ma’naviy ustozi Shamsiddin Kulol ko’milganlar, bu yerda uning katta o’g’illari Jahongir Mirzo va Umarshayx Mirzolar go’ri joylashgan. Ulug’ Sohibqironning o’zi ham uning joni shu yerda arshi a’loga uchib ketadi, deb o’ylagan edi. Hattoki maqbarani ham tayyorlab qo’ydi. Lekin taqdir buni boshqacha hal etdi… Ulkan Movarounnahr davlatini yaratgan va uning cheklanmagan hukmroni - amiri bo’lgan Temur Samarqandni o’z poytaxti sifatida tanladi. Lekin o’zining tug’ilib o’sgan kichik vatanini ham hech qachon unutmay, doimo unga g’amxo’rlik qildi. Aslida Shahrisabz davlatning ikkinchi poytaxti edi. Temurning avlodi, Buyuk Mo’g’ullar sulolasining asoschisi Bobur yozishicha: «Kesh shahri Temurbekning tug’ilgan joyi bo’lgani uchun, u shaharni taxt zainia aylantirish uchun ko’p gamhurlik qilgan edi». Amirning buyrug’i bilan bu yerga eng yaxshi me’morlar quruvchilar, me’morchilik bezaklarining ustalari yuborilgan, mahalliy ustalar bilan birgalikda ular turli mamlakatlarning tajribasi va an’analarini uyg’unlashtirib, ulug’vor binolarni barpo etganlar. Ularning ijodi bilimlar, tajriba, an’analar va yaratuvchilik urinishlarining yaxlitlashuvi tufayli ajoyib mevalar berdi, ular XIV asr oxiri – XV asr boshi O`rta Osiyo me’morchiligning xususiyatlarini belgilab bergan monumental uslubning asoslarini yaratdilar. Oqsaroy saroyi bayramona hukumat binosi – rezidentsiyaning namunasi bo’lishi mumkin. Saroyning qurilishi 1380 yilda boshlangan, lekin 1404 yilda ham unda pardoz ishlari tugatilayotgan edi. Bu ulug’vor inshootning o’qsimon gumbazi oralig’i 22 metrdan ortiq bo’lib, temuriylar barpo etgan barcha inshootar orasida eng antiqadir. Temur va temuriylarning davrida shahrlarning ansambllar bilan – majmuiy qurilishi keng tarqalgan. Bu Shahrisabzda ham yaqqol ko’rinadi, bu yerda Dorus-Tilovat va Dorus-Saodat ansambllari ajralib turadi. Dorus-Tilovatni sobiq mahalliy xodagonlar maqbarasida saqlanib qolgan uchta inshoot tashkil etadi. Bu Shamsiddin Kulol va Gumbazi Seyidon maqbaralari hamda Ko’k-Gumbaz jome’ masjidi inshootlaridir. Shamsiddin Kulol maqbarasi eng birinchi qurilgan. Shayx 1370 yilda vafot etgan bo’lib, uning go’ri izzat-ehtirom qilingan edi. Uning yonida Gumbazi Seyidon – Sayidlar gumbazi nomli Ulug’bek avlodlarining maqbarasi qurilgan. Bu kichik bino o’zining nafis mutanosibligi va chuqur o’ymakor naqshlar bilan qoplangan, ajoyib ishlangan kirish eshigi bilan insonni mahliyo qiladi. Me’morchilik ansamblini mo’g’ullargacha bo’lgan qurilish poydevorida qad ko’targan Ko’k-Gumbaz jome’ masjidi tugallaydi. Dorus-Saodat ansambli ham uchta qismidan iborat: Jahongir mirzoning go’ri, Hazrati Imom masjidi va Temurnig maqbarasi. 1376 yilda sohibqironning sevimli o’g’li Jahongir mirzo o’lganidan keyin Amir Temur shunday qayg’uga cho’mdiki, «sohibqironning qalbi hamdardlik uchun 30 yil yopiq edi». «Adolatli shahzoda, jasur jangchi, yer yuzida atirguldek ir ko’rinib yo’qolgan» shahzodaning jasadi ajdodlariing vataniga keltirildi, bu yerda uning uchun maqbara qurildi. Keyinroq maqbara oilaviy katta maqbara ichiga kiritilgan edi. Xona ohaktosh bilan qoplangan bo’lib, arkali o’yma tokchalar bo’ylab Qur’ondan olinagn foniy dunyoning bekorligi va boqiy dunyoning g’olibligi to’g’risidagi oyatlar o’yib ishlangan. Masjid va Jahongirning maqbarasiga yaqin joyda faqat Temur uchun mo’ljallangan go’r saqlanib qolgan maqbara bo’lgan, lekin uning o’zi, ma’lumki, Samarqandda dafn etilgan. Lekin Shahrisabz faqatgina buyuk amirning «taxt zamini» bo’lmagan. Temurning tug’ilishidan ancha ilgari u o’z tarixiga ega edi. Avvalo bu jahonnig eng qadimgi shaharlaridan biri. Olimlarning fikricha, Shahrisabz 2700 yoshda, bu esa «Boqiy shahar» Rimning yoshidir. YuNESKO qaroriga ko’ra aynan shu sana 2002 yilda butun madaniy dunyoda nishonlangan. Eramizdan avvalgi IV asrda iskandar Zulqarnayn lashkarlari dam olish uchun Kesh vohasida to’xtagan, Baqtriyaning satrapi bo’lgan Bess Doro III in o’ldirib, o’zini «osiyo podshohi» deb e’lon Kilgan, lekin uning o’zi aynan shu yerda asirga olingan. VII asrda shaharni arablar qamal qilgan, bir asr keyin esa Kesh shahri Muqanna rahbarligi ostida arablarga qarshi kuchli qo’zg’olonning markazi bo’ldi. Tinch davrda shahar hech qanday to’sqinliksiz o’sib rivojlanar edi, bunga uning gavjum Buyuk Ipak yo’lidagi nihoyatda qulay joylashuvi sabab bo’lgan. O’rta asrlar shoiri Mahmud ibn Vali shunday yozgan: «Kesh — Movarounnahr shaharlaridan… uni jahonning eng go’zal joylaridan biri, juda yaxshi va yoqimli iqlim bo’lgan joy deb hisoblashadi. Uning dalalari va bog’-rog’lari juda jozibali va zavqli». Hurmatli muallif so’zlariga rozi bo’lmay iloji yo’q. Haqiqatan ham Shahrisabz o’zining «Yashil shahar» ismiga juda mosdir.",
            "image": "city/shahrisabz"
        },
        {
            "name": "Navoiy",
            "region": "Navoiy viloyati",
            "description": "Maydoni 111 ming km.kv. Aholisi 979,5 ming kishidan ortiq (2019-yil 1-yanvar holati). Navoiy viloyatida 8 ta tuman, 6 ta shahar va 47 ta shaharcha mavjud. Bu viloyat mamlakatimizning eng kenja viloyati. U Buxoro va Samarqand viloyatlari hududidan tashkil topdi. Navoiy viloyati mamlakatimiz viloyatlari ichida maydonining kattaligi bo‘yicha birinchi o‘rinda tursada, aholisining soni bo‘yicha oxirgi o‘rinlardan birida turadi. Viloyatning o‘simlik (yaylov) boyligi qorako‘lchilikda katta ahamiyatga ega. Aholisi hudud bo‘ylab notekis joylashgan. Tomdi, Uchquduq, Konimex tumanlarida aholi nihoyatda siyrak. Sanoatning jadal sur’atlar bilan rivojlanishi shahar aholisining tez ko‘payishiga olib kelmoqda. Viloyatda yangi shahar va shaharchalar qad ko‘tarmoqda. Qishloq­ xo‘jaligining­ asosiy­ tarmoqlari: donchilik, paxtachilik, qorako‘lchilik, qo‘ychilik. Sanoatning­ asosiy­ tarmoq­lari: elektroenergetika, rangli metallurgiya, kimyo, qurilish materiallari sanoati. Cho‘l chorvachiligi sohasida bu viloyat mamlakatda yetakchidir. Qizilqum cho‘lida qorako‘lchilikka ixtisoslashtirilgan yirik xo‘jaliklar tashkil etilgan. Bu sohada Tomdi tumani alohida ajralib turadi, tumanda ko‘plab qorako‘lchilik xo‘jaliklari bor. Yaylovlarni suv bilan ta’minlash, ularning mahsuldorligini oshirish uchun fitomeliorativ ishlar olib borilmoqda. Sanoatning rivojlanishi suv boyliklariga bog‘liq. Taraqqiy etayotgan sanoat tarmoqlari, jumladan, kimyo sanoati va boshqalar suvni ko‘p talab qiladi. Viloyat kimyo sanoati tabiiy gaz va boshqa mineral xomashyoga tayanib tez rivojlanmoqda. Kimyo sanoatining markazi Navoiy shahridagi kimyo kombinatidir. Mamlakatimizda tayyorlanayotgan sement mahsulotining asosiy qismi Navoiy sement zavodida ishlab chiqarilmoqda. Zavod yaqin vaqtlargacha shlak, metall qipig‘i, klinker singari sement xomashyolarini sobiq Ittifoq respublikalaridan katta-katta xarajatlar hisobiga keltirardi. Xomashyoning qimmatligi sement ishlab chiqarishni ko‘paytirish va sifatini oshirishga to‘sqinlik qilardi. Geologlarning izlanishlari natijasida Malikcho‘l sarhadlarida, shundoqqina zavodning yonida tuf koni topildi. Tuf eng a’lo shlakdan ham, noyob aralashma–klinkerdan ham qolishmaydigan sement xomashyosidir. Kon zaxirasi katta bo‘lib, yiliga 2-3 mln tonna tuf qazib olinganda ham 45-50 yilga yetishi aniqlandi. Viloyat elektr energiyasini ishlab chiqarish miqdoriga ko‘ra mamlakatda oldingi o‘rinlardan birini egallaydi. Elektr energiyaning asosiy qismini Navoiy IES beradi. Mamlakatimizdagi ishlab chiqarish korхonalarini modеrnizatsiya qilish va yangilash, zamonaviy innovatsiyalarga asoslangan va yuksak samarali tехnologiyalarni joriy etish jadal amalga oshirilmoqda. Ularni amalga oshirishda kеrakli imtiyozlarga ega bo‘lgan maхsus industrial zonalar tashkil etilmoqda. Jumladan, «Navoiy» erkin industrial-iqtisodiy zonasi tashkil etilganidan buyon uning hududida 19 ta invеstitsiya loyihasi bo‘yicha ishlab chiqarish korхonalari ishga tushirildi. Jumladan, yuksak tехnologiyalar asosida tеlеvizorlar uchun taglik-moslamalar, elеktr enеrgiyani elеktron hisoblagichlar, yuqori kuchlanishga chidamli kabеllar, IESlar uchun isitish qozonlari, mobil va statsionar tеlеfon apparatlari, tayyor dori vositalari va boshqa turdagi mahsulotlar ishlab chiqarish yo‘lga qo‘yildi. Ijtimoiy­ sohalar. Viloyatda ikki oliy ta’lim muassasasi – Navoiy davlat pedagogika instituti va Navoiy davlat konchilik instituti faoliyat ko‘rsatmoqda. 380 ga yaqin umumta’lim maktablarining 120 tasi Qizilqumning olis cho‘l hududlarida joylashgan. Viloyat hududida ko‘pgina tarixiy maskanlar mavjud. Ular sirasiga qadimgi Karmana, Rabot Malik, Nurotadagi Toshmasjid tarixiy yodgorliklari, Chilustun, Ko‘kgumbaz, Qosimshayx maqbaralarini kiritish mumkin. Shaharlari. Navoiy tez yuksalayotgan yosh sanoat shahri (Аhоli mаnzilgоhlаri mаvzusidа shаhаr аhоlisi sоnini аniqlаng)dir. U viloyatning ma’muriy markazi. Zarafshon daryosining yaqinligi, yirik qishloq xo‘jalik hududi markazida joylashganligi, transport bilan yaxshi ta’minlanganligi shaharning tez o‘sish omili bo‘ldi. Shahar 1960-yillarda yagona bosh reja asosida issiq iqlim va milliy an’analarni hisobga olib qurildi. Shahar ko‘kalamzorlashtirilgan. Navoiyda mamlakatdagi yirik IES, elektr-kimyo kombinati, sement zavodi, kon-metallurgiya kombinati bor. Shahar sanoat va transport tuguni, muhim madaniyat markazidir. Zarafshon shahri Muruntov kon qazib olish sanoati bazasida 1972-yilda barpo etildi. Shaharda rangli metallurgiya, shuningdek, yengil, oziq-ovqat sanoat tarmoqlari yo‘lga qo‘yilgan.",
            "image": "city/navoiy"
        },
        {
            "name": "Andijon",
            "region": "Andijon viloyati",
            "description": "ANDIJON — Andijon viloyatidagi shahar. Viloyatning maʼmuriy, iqtisodiy va madaniy markazi. Oʻzbekistonning yirik industrial shaharlaridan biri. Shahar Fargʻona vodiysining sharqida. Andijonsoy yoqasida, dengiz sathidan 450 m balandlikda joylashgan. Iyulning oʻrtacha t-rasi 27° — 28°, yanv. niki — 3°. Aholisi 333,4 ming kishi (2000). Maydoni 74,3 km2. Andijon sh. shim.-gʻarbdan Oltinkoʻl tumani gʻarbdan Buloqboshi tumani va jan.-sharqdan Andijon tumanoʻ b-n chegaradosh. Shaharning paydo boʻlishi va nomining kelib chiqishi haqida turli xil afsona va rivoyatlar mavjud. Ayrim manbalarda shahar nomi «andi», «adoq» («azoq») kabi urugʻ atamalari bilan bogʻliqligi koʻrsatilgan. Bir vaqtlar bu yerda andilar (hindlar) yashagan va shaharning nomi «Andukon» deb atalgan, degan rivoyat ham bor. A. ning Ark qismida (hoz. Bobur mahallasi) va Shahristonda olib borilgan arxeologik qazishlar natijasida 7 — 8 – a. larga oid buyumlarning topilishi uning Oʻrta Osiyodagi koʻhna shaharlardan biri ekanligini tasdiqpaydi. Oʻrta asrlarda shahar Arki mudofaa devorlari bilan oʻrab olingan. Arab xalifaligi davrida Andukon deyilgan. Andijon ilk bor yozma manbalarda 10-a. arab sayyohlari Ibn Havqal va Muqaddasiy asarlarida Andukon shaklida qayd etilgan. 11-a. da shahar Koraxoniylar hukmronligi ostiga oʻtgan. 11—12 – a. larda Fargʻona vodiysining yirik savdo va hunarmandchilik markaziga aylangan. Shahar moʻgʻullar istilosi davrida vayron etilgan va manbalarda qayd etilishicha, 13 – a. oxirlarida moʻgʻul xonlari boʻlmish Tuva va Xaydu tomonidan qayta tiklangan. Andijon 14-a. 70-ylarida Fargʻona vodiysi bilan birga Amir Temur davlati tarkibiga kirgan. 15-a. 2-yarmidan Andijon Temuriylar davlatiga qarashli Fargʻona viloyatining poytaxti boʻlgan. Ayniqsa Umarshayx Mirzo va uning oʻgʻli Zahiriddin Muhammad Bobur davrida shaharda xoʻjalik, fan, madaniyat rivoj topgan. Xususan, Bobur oʻzining mashhur «Boburnoma» asarida Andijonni shunday taʼriflaydi: «Oshligʻi vofir, mevasi farovon, qovun va uzumi yaxshi boʻlur. Qovun mahalida poliz boshida qovun sotmoq rasm emas… Andijon noshpotisidan yaxshiroq noshpoti boʻlmas. Movarounnahrda Samarqand va Kesh (hoz. Shahrisabz) qoʻrgʻonidin soʻngra mundin ulugʻroq qoʻrgʻon yoʻqtur. Uch darvozasi bor… Toʻqqiz tarnov suv kirar. Bu ajabdurkim bir yerdan ham chiqmas… Eli turkdur»… 1504-y. dan Andijon shayboniylar qoʻl ostiga oʻtgan. 1710-y. da Qoʻqon xonligi tarkibiga kirgan va Rossiya Qoʻqon xonligini butunlay bosib olguniga qadar (1876-y. gacha) Andijon bekligining qarorgohi boʻlgan. Shaharda mahalliy xalqdan tashqari Sharqiy Turkiston (Sinszyan)dan kelganlar ham yashagan. Shahar oʻzining hunarmandchilik buyumlari, ip va ipak gazlamalari bilan shuhrat qozongan. 19-a. oʻrtalarida Andijon 4 dahaga boʻlingan edi. Har bir dahaning qozisi, mingboshisi boʻlgan. Dahalar oqsoqol boshliq mahallalarga boʻlingan. 1877-y. da shaharga yondosh Xoqon (Xaqan) qishlogʻi aholisi koʻchirilib oʻrnida rus bosqinchilari uchun yangi shahar qurila boshladi. Shahar Rossiya bilan temir yoʻl orqali bogʻlangach (1899), q. x. mahsulotlarini qayta ishlaydigan dastlabki sanoat korxonalari vujudga keldi. 1898-y. A. da podsho hukumati maʼmurlarining zulmiga qarshi Dukchi Eshon — Muhammadali xalfa Sobir oʻgʻli rahbarligida xalq qoʻzgʻoloni boʻlib oʻtdi. Qoʻzgʻolon nihoyatda shafqatsizlik b-n bostirildi, koʻplab begunoh odamlar oʻldirildi, qoʻzgʻolon tashkilotchilari qatl etildi (q. Andijon qoʻzgʻoloni). Andijon kuchli seysmik zonada joylashgan. 1902-y. 16 dek. da 9 balli zilzila boʻlib, mahalliy aholi uylari butunlay vayron boʻldi (q. Andijon zilzilasi). 1916-y. A. mehnatkashlari podsho hukumatining mardikorlikka olish siyosatiga qarshi xalq qoʻzgʻolonida faol qatnashdi.",
            "image": "city/andijon"
        },
        {
            "name": "Farg'ona",
            "region": "Farg'ona viloyati",
            "description": "Maydoni 6,7 ming km.kv. Aholisi 3 million 683 ming 300 kishidan ortiq (2019-yil 1-yanvar holati). Farg`ona viloyatida 15 ta tuman, 9 ta shahar va 197 ta shaharcha mavjud. Viloyatga vodiyning tekislik qismi, Oloy va Turkiston tizmalarining tog‘oldilari kiradi. Isfayram, Shohimardon, So‘x, Isfara daryolarining dehqonchilikda ahamiyati katta. Norin bilan Qoradaryodan bir necha sug‘oruv kanallari chiqarilgan (ularni o‘quv atlasidan qarab chiqing). Viloyat yalpi sanoat mahsulotiga ko‘ra faqat Toshkent viloyatidan keyinda turadi. Qishloq ­xo‘jaligining ­asosiy ­tarmoqlari: donchilik, paxtachilik, bog‘dorchilik, uzumchilik, go‘sht-sut chorvachiligi, parrandachilik, ipakchilik. Sanoatning ­asosiy ­tarmoqlari: elektroenergetika, kimyo, neftni qayta ishlash, qurilish materiallari, yengil sanoat va oziq-ovqat sanoati Farg‘ona viloyati qishloq­ xo‘jaligi paxta va g‘alla yetishtirish hamda pillachilikka ixtisoslashgan. Ekin maydonining asosiy qismiga paxta va g‘alla ekiladi. Bug‘doy va arpa bahorikor yerlarda, sholi esa zaxkash yerlarda yetishtiriladi. Makkajo‘xori, oq jo‘xori va beda hamma tumanlarda paxta bilan almashlab ekiladi. Bog‘dorchilik, uzumchilik uchun viloyatda sharoit qulay. Viloyat anori va anjiri bilan dong chiqargan. Farg‘ona viloyatida yaylovlar Andijon viloyatidagiga qaraganda ancha ko‘p. Chorva mollari, asosan, qo‘y va echkilardan iborat. Viloyat mamlakatda yetishtiriladigan pillaning 20 foizga yaqinini beradi. Sanoati ko‘p tarmoqli bo‘lib, unda og‘ir sanoatning salmog‘i ancha katta. Neftni qayta ishlash, kimyo va energetika sanoati iqtisodiy rayondagina emas, balki respublikada ham ajralib turadi. Neftni qayta ishlaydigan 2 ta zavod bo‘lib, biri Farg‘onada, ikkinchisi Oltiariqda joylashgan. Mashinasozlik, metallsozlik va binokorlik materiallari ishlab chiqaruvchi tarmoqlar ham muhim ahamiyatga ega. Yengil va oziq-ovqat sanoati qishloq xo‘jalik tarmoqlari negizida vujudga kelgan. Sanoat korxonalari Farg‘ona-Marg‘ilon sanoat rayoni va Qo‘qon, Quvasoy sanoat tugunlarida to‘plangan. Transporti. Viloyat temiryo‘l va avtomobil yo‘llari bilan yaxshi ta’minlangan. Viloyatdan paxta tolasi va paxta moyi, shoyi, ip-gazlama, trikotaj mollar, quritilgan meva, meva konservalari, mineral o‘g‘it va sement jo‘natiladi. Taxtayog‘och, har xil uskunalar, traktorlar, paxtachilik uchun zarur mashinalar, g‘alla, un, qand, keng iste’mol buyumlari keltiriladi. Shaharlari. Viloyatda 9 ta shahar bor. Farg‘ona muhim sanoat, transport va madaniyat markazidir. Shahar suv bilan yaxshi ta’minlangan, yozi birmuncha salqin. Shaharda ikkita IEM ishlab turibdi. Iqtisodiy rayonning birlashgan energetika tizimi shu IEMlar asosida shakllangan. Shaharda Farg‘ona davlat universiteti, politexnika instituti, Toshkent axborot texnologiyalari universiteti, Toshkent tibbiyot akademiyasi hamda O‘zbekiston davlat san’at va madaniyat institutlarining filiallari faoliyat ko‘rsatadi. Ipakchilik ilmiy tadqiqot instituti bor. Madaniyat va istirohat bog‘lari, favvoralar, xiyobonlar, soya-salqin maydonlar shaharga o‘zgacha tarovat beradi. Buyuk astronom, matematik va geograf Ahmad al-Farg‘oniy shu makonda tavallud topgan. Marg‘ilon shoyi (atlas) ishlab chiqarishning markazi sifatida qadimdan dong chiqargan shahar. Shaharda paxta, ko‘n zavodi, ipak ishlab chiqaruvchi korxonalar bor. Marg‘ilonliklarning to‘qimachilik malakasi yuksak darajada takomillashdi va keng quloch yoydi. Marg‘ilon shoyi kombinati mamlakatdagi eng yirik to‘qimachilik korxonalaridan biridir. Kombinat ayni vaqtda yirik o‘quv markazi hamdir. Unda Ipakchilik ilmiy tadqiqot instituti ham faoliyat ko‘rsatmoqda. Mashhur fiqh olimi Burhoniddin Marg‘inoniy shu yerda tug‘ilgan. Qo‘qon Farg‘ona viloyatining g‘arbida, transport yo‘llari ustida joylashgan. Undan Toshkent, Namangan va Farg‘ona tomonlarga temiryo‘l va avtomobil yo‘llari o‘tadi. Mustaqillik yillarida Qo‘qonning sanoati rivojlanib, shahar muhim sanoat tuguniga aylandi. Shahardagi superfosfat zavodi hamda elektr mashinasozligi, to‘qimachilik mashinasozligi zavodlari respublikadagi yirik korxonalardandir. Shahar uzoq vaqt Qo‘qon xonligi poytaxti bo‘lgan. U viloyatdagi asosiy madaniyat markazlaridan biridir. Quvasoy 1954-yilda ishchi shaharchasi o‘rnida barpo etilgan. Shahar yaqinidagi ohak, mergel, gips va gil boyliklari negizida u qurilish materiallari ishlab chiqaradigan sanoat markaziga aylandi. Endilikda sement, shifer, ohak hamda g‘isht zavodlaridan iborat kombinat ishlab turibdi. Mazkur kombinat respublikada ishlab chiqariladigan sementning salmoqli qismini bermoqda. Quvasoy chinni zavodida kosa, piyola, choynak, lagan va boshqa idishlar ishlab chiqarish yildan yilga ortmoqda. Rishton – kulolchilik buyumlari ishlab chiqaradigan markaz. Bundagi kulolchilik artellari birlashtirilib, kombinatga aylantirilgan. Hozir kombinatda 20 xildan ortiq buyum ishlab chiqarilmoqda.",
            "image": "city/fargona"
        },
        {
            "name": "Qarshi",
            "region": "Qashqadaryo viloyati",
            "description": "Qashqadaryo vohasining markazida, Qashqadaryo boʻyida, xalqaro temir yoʻl va avtomobil yoʻllari kesishgan joyda. Maydoni 7,5 ming gektar. Aholisi 275 ming kishi (2021). Qarshi Oʻzbekistonning qadimiy shaharlaridan biri. U turli davrlarda Bolo, Nashebolo, Naxshap, Nasaf, nomlari bilan yuritilib, XIV asrdan Qarshi deb atala boshlagan. Qarshi shahrining oʻzbek tarixida oʻziga xos oʻrni bor. Birinchidan, Qarshi — Movarounnahrdagi birinchi yirik turkiy tilli shahar. U payti Xorazmda (Urganch), Fargʻonada (Andijon), Shosh vohasida (Toshkent), Sirdaryo boʻylarida bir qancha yirik shaharlarda turkiy til hukmron edi, lekin Movarounnahrda bunday shahar yoʻq edi. Qarshining qurilishi bilan bu yerda turli-tuman aholi joylashdi, ammo turkiy shaharda hukmron tilga aylandi. U payti moʻgʻullarning oʻzi ham allaqachon turkiy tilda gapirardi. Xususan, Kebakxonning ona tili turkiy til boʻlganini arab sayyohi Ibn Battuta qayd etgan. Chigʻatoy ulusi, undan keyin Temuriylar davrida turkiy til rasmiy yozishmalar tili boʻlib xizmat qildi. Hozirda Qarshi shahrida paxta tozalash, yogʻ-ekstraksiya, sut, motor taʼmirlash, taʼmirlashmexanika, uysozlik, plastmassa buyumlari zavodlari, goʻsht va un kombinatlari, tikuvchilik fabrikasi, qurilish materiallari, temir yoʻl transporti, toʻqimachilik korxonalari bor. Shaharda 6 ta bozor, 17 ta bank filiali aholiga xizmat koʻrsatmoqda. Qarshi davlat universiteti, Qarshi muhandislik-iqtisodiyot instituti, Toshkent axborot texnologiyalari instituti Qarshi filiali, Toshkent irrigatsiya va qishloq xoʻjaligini mexanizatsiyalash muxandislari instituti Qarshi filiali, tibbiyot, pedagogika va boshqa jami 13 kasb-hunar kolleji, 3 akademik litsey, 9 litsey va litsey-internat, 2 gimnaziya, 46 umumiy taʼlim, shuningdek, bolalar musiqa maktablari, 4 teatr (shu jumladan, viloyat musiqali drama teatri, viloyat qoʻgʻirchoq teatri va boshqalar), viloyat oʻlkashunoslik muzeyi, filarmoniya, 13 kutubxona, 3 madaniyat va istirohat bogʻi faoliyat koʻrsatadi. 22 kasalxona, ambulatoriya-poliklinika va boshqalar tibbiy muassasalar bor. Qarshidan Toshkent, Samarqand, Buxoro, Andijon, Termiz kabi shahaarga avtobus, poyezd qatnovlari, Qarshi aeroportidan Qarshi — Moskva, Qarshi — Toshkent yoʻnalishlaridagi havo yoʻllarida samolyotlar qatnovi yoʻlga qoʻyilgan. Qarshida Koʻkgumbaz masjidi (XVI asr), qadimiy hammom (XVI asr), Qashqadaryo ustidagi qadimiy koʻprik (1583), Sharofboy madrasasi (XVIII asr boshlarida), Charmgar masjidi (XIX asr oʻrtalari), Bektemir madrasasi (1905), Xoja Abdulaziz madrasasi (XIX asr), Qilichbek madrasasi (XIX asr) va boshqa meʼmoriy obidalar saqlanib qolgan.",
            "image": "city/qarshi"
        },
        {
            "name": "Qo'qon",
            "region": "Farg'ona viloyati",
            "description": "Qoʻqon — Fargʻona viloyatida, sharqiy Oʻzbekistondagi shahar. Soʻx daryosi (tarmogʻi) ning quyi oqimida joylashgan. Aholisi — 254 700 nafar (2020-yil). Qoʻqon xonligining poytaxti boʻlgan. Bu shahar Fargʻona viloyatining yirik shaharlaridan biridir. Mahalliy tarixchi va arxeologlar orasida shaharning yoshi 2 ming yildan ziyod degan taxmin mavjud. Qoʻqonga oid dastlabki maʼlumotlar 10-asr yozma manbalarida uchraydi. Etimologiyasi haqida turli taxminlar bor [mas, Istaxriy va Ibn Havqal asarlarida „Havokand“ (Hoʻkand) shaklida, yaʼni „goʻzal“, „yoqimli“ yoki „shamol shahri“ maʼnosida uchraydi]. Keyingi asrlarda „Hoʻqandi latif“ degan atama ham ishlatilgan. Undan tashqari „balandlikdagi shahar“, „hular shahri“ [yaʼni, „hu (ku) qabilasi — elati shahri“] versiyalari ham bor. Qadimiy Xitoy qoʻlyozmalarida Qoʻqon nomi „Guyshan“, „Xoʻxan“ tarzida ifodalangan.[4] Qoʻqonning 18-asrgacha boʻlgan siyosiy tarixi haqida maʼlumotlar juda oz. Qoʻqon podsho Rossiyasi qoʻshinlari tomonidan zabt etilganda Qoʻqon xonligi arxivining koʻp qismi olib ketilgan. Qoʻqon qadimda Hindiston va Xitoyga boriladigan karvon yoʻlida joylashgan. 13-asrda moʻgʻullar tomonidan butunlay vayron qilingan. Shundan keyin 18-asrgacha Qoʻqon kichik aholi turar joyi sifatida mavjud boʻlgan. 1709 yili Qoʻqon xonligi tashkil topgach, 1711 yili Eskiqoʻrgʻon qalʼasi oʻrnida hozirgi Qoʻqon shahriga asos solindi, istehkom va qalʼa barpo etildi. 1732 yili Abdurahimbiy bu ishni nihoyasiga yetkazdi va shaharni xonlik poytaxtiga aylantirdi. Shu davrdan boshlab shahar Qoʻqon deb atala boshladi. Shaharning mustahkam devori, 12 darvozasi (Xoʻjand, Gʻoziyogʻliq, Quduqliq, Sarmozor, Namangan, Chimyon, Soʻx, Margʻilon, Rishton, Moʻyimuborak, Qatagʻon, Isfara) boʻlgan. Qoʻqon hududi 12 maʼmuriy boʻlak (daha)ga taqsim qilingan. Shaharda 3 mingga yaqin xonadonda 31 ming kishi yashagan. Norboʻtabiy davrida (1766—98) ravnaq topdi, Sharqning savdo-sotiq va hunarmandchilik markazlaridan biriga aylandi. Olimxon hukmronligi davrida (1801 — 1810) esa Qoʻqonning siyosiy mavqei kuchaydi. Umarxon (1810—22) va uning oʻgʻli Muhammad Alixon (1822—1842) hukmronligi davrida Qoʻqonda fan, madaniyat, adabiyot va sanʼat markaziga aylandi. 1842-yilda Buxoro amirligi hukmdori Nasrulloxon tomonidan bosib olindi. Qoʻqon xonligi rus qoʻshinlari tomonidan ishgʻol etilib, Turkiston general-guber-natorligiga qoʻshib olingach (1876), Qoʻqon yangi tashkil etilgan Turkiston general-gubernatorligining Fargʻona viloyati maʼmuriy markazi boʻladi. Viloyat markazi Yangi Margʻilonga koʻchirilgandan keyin (1877-yil 27-aprel), Fargʻona viloyati uyezd shahri, soʻng vodiyning eng yirik shaharlaridan biri boʻlib qoldi.",
            "image": "city/qoqon"
        },
        {
            "name": "Namangan",
            "region": "Namangan viloyati",
            "description": "Namangan - qadimiy shaharlardan biri bo’lib, uning tashkil topishi tarixiy manbaalarga ko’ra taxminan 1610 yillarga to’g’ri keladi. Namangan shahri rel'yefi asosan tekislik mintaqa xarakteriga ega. Yer yuzasi shimoldan janubga va g’arbdan sharqqa tomon pasayib boradi. Iqlimi keskin kontinental bo’lib, janubiy, ya’ni tekislik mintaqasida subtropik. Yoz oylarida harorat keskin ko’tarilib, havo quruq va issiq bo’ladi. Shahar Farg’ona vodiysining shimoliy qismida joylashgan bo’lib, dengiz sathidan 450 metr balandlikda joylashgan. Namangan shahri shimoldan Kosonsoy va Yangiqo’rg’on, sharqdan Uychi, janubdan Namangan tumani, g’arbdan Namangan va To’raqo’rg’on tumanlari bilan chegaradosh. Namangan shahri viloyatning markazi hisoblanib, umumiy maydoni 101,5 kv.km bo’lib, shundan 1,57 kv.km ekin maydoni, 23,27 kv.km uy-joy fondi, 2,34 kv.km daraxtzorlar, 1,52 kv.km yaylov, 0,13 kv.km o’rmon, 62,24 kv.km yo’l, ariq va boshqa yerlarni tashkil qiladi. Shahar aholisi 2011 yilning 1 yanvar holatiga 451,0 ming kishiga yetgan. Hozirgi kunda shaharda 81 ta mahalla fuqarolar yig’ini bo’lib, ularda 105 504 ta xonadon hamda 116 905 ta oila istiqomat qiladi. Shaharda 20 dan ortiq millat vakillari yashaydi. Aholining 95,9 foizini o’zbeklar tashkil etadi. Aholining zichligi 1 kv. kilometrga 5433 kishi to’g’ri keladi. Tarixchi va adabiyotshunos olim Ahmad Ubaydulloning ta’kidlashicha, Namangan X asrda ham shahar sifatida mavjud va mashhur bo’lgan. Albatta, bu mavzu chuqur ilmiy tadqiqotlarni taqozo etadi. Yoki sayohatchilardan birining yozishicha, Farg’ona vodiysida bundan 2000 yil oldin ham 70 ta katta-kichik shaharlar, qishloqlar bo’lgan. Ana shular qatorida Namangan shahri ham bo’lganligiga shubha yo’q. Eramizdan oldingi IV-II asrlarda Farg’ona vodiysi, shu jumladan, Namangan shahri ham O’rta Osiyoda eng yirik shaharlardan biri bo’lgan. Aholisi asosan dehqonchilik, sholikorlik, g’alla, paxtachilik bilan shug’ullangan. Xo’jaligida uzumchilik, chorvachilik ham muhim o’rinni egallagan. Ichki va tashqi savdo kengayib, boshqa mamlakatlar bilan o’zaro aloqalar kuchayib borgan. Natijada shaharsozlik, hunarmandchilik rivojlangan. 1620 yilda kuchli zilzila oqibatida Axsikent vayron bo’lgan. Omon qolgan kishilar hozirgi Namanganga ko’chib kela boshlagan. Asta-sekin Namangan shahriga asos solingan. Bundan xulosa shuki, Namangan shahri qadimgi Axsikentning vorisi deyish mumkin. Namangan shahrining rivojlanishida 1818-1821 yilda qurilgan Yangiariqning ahamiyati juda katta bo’lgan. Ariq qazishda har bir hovlidan bir kishidan vakil ishtirok etgan. Kanal 3 yilda bitib, undan suv oqa boshlagan. Bu paytda o’zining hunarmandlari, naqqoshlari, to’quvchilari, temirchilari, bo’yoqchilari, zargarlari hamda kosiblari bilan nainki O’rta Osiyoda, balki Ovro’paning bir qancha mamlakatlarida Namangan nom qozongan. Bog’dorchilik, pillachilik rivojlangan. Buyuk ipak yo’lida joylashganligi uchun Namangan savdogarlari Buxoro, Xitoy singari mamlakatlarga mahsulotlarini olib borganlar, o’z navbatida u yerlardan aholi ehtiyoji uchun zarur bo’lgan turli buyumlarni olib kelganlar. Savdo-sotiqning rivojlanishi natijasida madaniy aloqalar ham mustahkamlangan. 1912 yilda Namanganni Qo’qon bilan bog’lovchi temir yo’l ishga tushirildi. Namangan Turkiston o’lkasining sanoat markaziga aylangan. Maorif va tibbiyot sohasi ham rivojlangan. Maktab va madrasalar soni jihatidan Namangan uezdi birinchi o’rinda bo’lgan. Shuningdek, shaharda ko’plab tarixiy me’morlik obidalari va ziyoratgohlar bor. Mulla Qirg’iz madrasasi, Ota Valixon To’ra va SHayx Isxoq Eshon masjidlari, Mulla Bozor Oxund maqbarasi, Xo’ja Amin maqbarasi, O’n bir Axmad kabi ziyoratgohlari hozirda ham diqqtga sazovor qadamjolar sifatida e’tiborda saqlanadi. Sharqning mashhur otashnafas shoiri Boborahim Mashrabning Vatani ham Namangan hisoblanadi. Mashrab ijodi va adabiy merosiga e’tibor ayniqsa mustaqillik yillarida yuqori bo’ldi. Jumladan, mustaqillikning dastlabki yillarida otashnafas shoir Boborahim Mashrabning ustozi Mulla Bozor Oxund maqbarasi bunyod etildi. SHuningdek, 50 gektar yerda Mashrab nomidagi madaniyat va istirohat bog’iga asos solindi. Bundan tashqari bu so’lim go’shada otashnafas shoir Abu Rashid Axsikatiy, Nodim Namongoniy, Usmon Nosir, Rafiq Mo’min singari erk va ozodlik kuychilari yashab o’tganlaryu El sevgan san’atkorlar, Mukarrama Azizova, Sobir Rahmonov, Muhriddin Mansurov, Habiba Oxunova, Kamoliddin Rahimovlar ham Namanganning atoqli farzandlaridir. Namangan - gullar shahri. Bu yerda 50 yildirki, an’anaviy gul bayrami o’tkazib kelinmoqda. O’zbekiston Respublikasi mustaqillikka erishgach, Namanganda ham barcha sohalarda katta o’zgarishlar yuz berdi. Birinchi navbatda shaharni obodonlashtirish, ko’kalamzorlashtirish, ko’chalarni kengaytirish, yangi-yangi bino, inshootlar qurishga alohida e’tibor qaratildi. Mustaqillik yillarida shahardagi yo’llarni keng va ravon qilish borasida ham katta hajmdagi ishlar bajarildi. Jumladan, «Do’stlik», Oxunboboev, Marg’ilon, Navoiy, A.Temur, Oromgoh ko’chalari kengaytirildi. Viloyatning havo darvozasi bo’lgan Aeroport binosini qayta kapital ta’mirlash, jahon andozalariga mos ravishda qayta qurish ishlari bajarildi. Namangan aeroporti hatto eng yirik «Boing» rusumli samolyotlarni qabul qilish imkoniyatiga ega.",
            "image": "city/namangan"
        }
    ],
    "holiday": [
        {
            "name": "Yangi yil",
            "date": "1-yanvar",
            "description": "Yevropa Yangi yilini nishonlash odati O‘zbekistonga sovet davrida kirib kelgan. Mahalliy aholi g‘arb madaniyati an’analarini yaxshi ko‘rib qoladi. Qish tantanalari davrida mamlakat shaharlarida ajoyib muhit hukm surgan. Bayramga tayyorgarlik dekabr oyi kelishi bilanoq boshlangan. Shaharlar va qo‘rg‘onlar ko‘chalari bayram girlyandalari va dekoratsiyalar bilan bezatilgan. Maydonlarda, savdo markazlarida, restoranlar va qahvaxonalarda archalar bezatilgan. Do‘konlarning vitrinalari bayram installyatsiyalari bilan bezalgan. hamma joyda samimiy tabriklar bitilgan plakatlarni ko‘rish mumkin bo‘lgan. Qish bayrami arafasida uylarda ham tirik yoki sun’iy archa o‘rnatilgan, uning ostiga Qorbobo haykalchasini qo‘yishgan. Eng ommabop bezak – derazalarga yopishtiriladigan qo‘lbola qor zarralari bo‘lgan. Hozir ham 31-dekabr kuni ommaviy sayllar boshlanadi. Toshkentda mamlakatning eng asosiy archasi o‘rnatiladigan O‘zbekiston Milliy kutubxonasi yonidagi maydon shunday sayllarning markazi hisoblanadi. Uning uzunligi 36 metrni tashkil qiladi, u 25 mingdan ortiq o‘yinchoqlar bilan bezatilgan bo‘lib, MDH mamlakatlari orasida eng katta archalardan biri hisoblanadi. Yangi yil kechasi butun Toshkent bo‘ylab bayram mushakbozligi o‘tkaziladi. Shahar tsirki yonidagi maydon bolalarning sevimli joyiga aylangan. Unda attraktsionlar, shirinliklar va o‘yinchoqlar bilan savdo qiluvchi savdo palatkalari o‘rnatiladi. Bolalar uchun archa ostida Qorbobo o‘zining doimiy hamrohi Qorqiz bilan sovg‘alar olib keladi. Ushbu bayram qahramonlari bug‘ular o‘rniga eshakchada yurishadi. O‘zbekistonda yangi yil ta’tillari yorqin va o‘ziga xos o‘tadi. Shaharlarda yangi yil kechasida va tantanalar arafasida turli bayram tadbirlaridan iborat dasturlar tayyorlanadi. Restoranlar va mehmonxonalar turli bayram bazmlarini va shoy-dasturlarni taklif qiladi. Eng katta sayllar va konsertlar Toshkentda o‘tkaziladi. Hordiqni madaniy dastur bilan boyitish mumkin, unga O‘zbekiston poytaxti bo‘ylab diqqatga sazovor joylar ekskursiyasi ham kiradi. Turistlar orasida gastronomik turlar juda ommabop bo‘lib, ular degustatsiyalarni va milliy taomlarni tayyorlash bo‘yicha mahorat darslarini o‘z ichiga oladi. Qishki sport turlarining ishqibozlari tog‘-chang‘i kurortlaridan hayratga tushishi mumkin. Ularning orasida eng mashhuri – Chimyon va Bildirsoy kurortlari bo‘lib, ular Toshkentdan shimoli-sharqda joylashgan. Kurortlarda barcha qiyinlik darajasidagi trassalar, manzarali tabiat va qulay iqlim sharoitlari mavjud.",
            "image": "holiday/yangiyil"
        },
        {
            "name": "Navro'z",
            "date": "21-mart",
            "description": "Bahor kelishi barcha davrlarda odamlarning hayotidagi eng quvonchli hodisa bo‘lgan. Odamlar uni tabiatning uyg‘onishi, hayot tantanasi, saxovatli hosildor yilga bo‘lgan umidlar bayrami deb bilgan. Fors tilidan tarjimada \"Navro‘z\" \"yangi kun\" degani, u yangi yil boshlanishini bildiradi. 21-mart – bu bahorgi teng kunlik. Shu kuni yarim sharlar bo‘yicha yil fasllari almashadi: agar janubiy yarim sharda kuz kelsa, shimoliy yarim sharda – bahor bo‘ladi. O‘zbekistonda odamlar bu bayramga puxta tayyorgarlik ko‘radi va 15-20 kun davomida bayram qiladi. Navro‘z arafasida mahallalarda hasharlar o‘tkaziladi, odamlar birgalikda ariqlarni tozalaydi, daraxtlarni oqlaydi, tomorqalarga belkurak bilan ishlov berishadi. Har bir mahallaning o‘z choyxonasi bor. Choyxonalarda Navro‘z bayrami nishonlanadi, katta qozonlarda mazali taomlar pishiriladi. Bayramga shu mahallada va qo‘shni mahallalarda istiqomat qiluvchi fuqarolar taklif etiladi Ushbu bayramning asosiy atributlaridan biri – bu sumalak, u o‘stirilgan bug‘doydan tayyorlanadi. Sumalak tayyorlash jarayoni – butun bir marosim hisoblanadi. Uni tayyorlash ko‘p vaqtni oladi – 10 soatdan ortiq vaqt davomida tayyorlanadi. Odatda sumalak ko‘chada ulkan o‘choq va qozonda yog‘och kapgir bilan aralashtirgan holda tayyorlanadi. Sumalakni tayyorlash jarayonida bir necha kishi qatnashadi, chunki suyuqlikni muntazam ravishda aralashtirib turish lozim, bu esa bir kishi uchun qiyinlik qiladi. An’anaga ko‘ra, qaynash jarayoni quvnoq qo‘shiqlar, hazillar va laparlar bilan kechadi. Erkaklar sumalakni tayyorlash jarayonisha qo‘yilmaydi! Sumalak quyulib, jigarrang tusga kirgunga qadar qaynatiladi. Keyin sumalak biroz vaqt dam oldirib qo‘yiladi, ustidan qopqoq yoki biror qalin narsa yopiladi. Umuman olganda Navro‘z bu shunchaki bayram emas. Navro‘z necha asrlardan buyon nishonlanib kelayotgan bo‘lsa, u qanchalik quvnoq va shodon o‘tsa, tabiat ham odamlarga shunchalik saxiy bo‘ladi, degan rivoyat ham shuncha asrlardan buyon mavjud. Shu bois bayram kuni Navro‘z qo‘shiqlari baralla yangraydi, odamlar o‘yin-kulgu qiladi, bahorga shon-sharaflar o‘qiydi, bir-biriga sovg‘alar hadya qiladi, yetimlar va ehtiyojmandlarga yordam beradi. Oxirgi paytlarda turistlar o‘zbek milliy bayramlariga ko‘proq qiziqish bildirmoqda. Chunki shunday bayramlar orqali xorijliklar o‘zbek madaniyati bilan yaqinroq tanishishi mumkin.",
            "image": "holiday/navroz"
        },
        {
            "name": "Xalqaro xotin-qizlar kuni",
            "date": "8-mart",
            "description": "Bugungi kunda ushbu bayram dunyoning 40 ta mamlakatida, asosan postsovet hududida hamda ayrim Sharqiy Yevropa, afrika va Osiyo mamlakatlarida davlat darajasida nishonlanadi. Mazkur bayram O‘zbekistonda ham keng nishonlanadi. 8-Mart arafasida an’anaga ko‘ra O‘zbekiston ayollarini prezident, idoralar va tashkilotlarning rahbarlari tabriylaydi. O‘zbekiston erkaklari gul do‘konlaridagi barcha gullarni qoldirmasdan xarid qiladi. Gullardan tashqari erkaklar konfetlar, mevalar, shirinliklarga to‘la savatchalarni hadya qilishadi, bayram tadbirlarini uyushtirishadi. Havo sharlari, raqas shousi – bugun O‘zbekistonda 8-Mart bayrami shunday nishonlanadi. Odamlar juftlari, oilalari, do‘st-birodatlari bilan uyda va restoranlarda to‘planadi. DAN xodimlari ayol haydovchilarni to‘xtatib, ularga gul sovg‘a qilishadi.",
            "image": "holiday/xotinqizlar"
        },
        {
            "name": "Vatan Himoyachilari kuni",
            "date": "14-yanvar",
            "description": "O‘zbekistonda tarixiy ahamiyatga ega bo‘lgan milliy bayram. Ushbu sana bejiz tanlanmagan. 1992-yil 14-yanvar kuni O‘zbekiston Qurolli kuchlari shakllantirilgan kun. Shu kuni Mustaqillik maydonida tantanali marosim o‘tkaziladi, unda Respublika gimni yangraydi, harbiy orkestrning tantanali sadolari ostida harbiy bo‘linmalar marsh bilan o‘tadi. Monument poyiga gulchambarlar qo‘yiladi va Oliy Bosh qo‘mondonning Vatan himoyachilariga bag‘ishlangan bayram nutqi yangraydi. O‘zbekistonda ushbu bayram kunida aholi barcha erkaklarni tabriklaydi, sovg‘alar tayyorlab, mazali taomlarga to‘la dasturxon yozadi. Bayram kunida nafaqat harbiylar, balki turli yoshdagi barcha erkaklar tabrik nomalarini oladi. Har bir o‘g‘il bola yoki pensiyadagi qariya ham Vatan himoyachisi hisoblanadi, chunki kelajakda o‘sib kelayotgan avlod mamlakat qahramonlariga aylanadi, keksalar esa Vatan uchun o‘z xizmat burchlarini ado qilib bo‘lgan. Ushbu sanada O‘zbekistonda Temuriylar imperiyasiga asos solgan buyuk sarkarda va jahongir Amir Temur (1336-yil 9-aprel – 1405-yil 18-fevral) xotirasi yod etiladi. Uni milliy qahramon sifatida qadrlashadi, chunki Amir Temur (Temurlang) sadoqatli askarlarni tayyorlagan. Ushbu sarkarda nafaqat qo‘shni mamlakatlar bilan, balki Oltin O’rda, Usmoniylar imperiyasi va Hindiston bilan ham janglar olib borgan. Temur uchun qo‘shni davlatlarning yerlarini talon-taroj qilish emas, balki Vatanni O’rdadan himoya qilish muhim bo‘lgan. Shu bois Vatan himoyachisi kunida odamlar buyuk sarkardaning xotirasini yod qilishni o‘zlarining burchi deb biladi. Butun O‘zbekiston aholisi uchun Vatan himoyachilari kuni katta ahamiyatga ega. Ushbu bayram davlat erkinligi va mustaqilligining ramzidir.",
            "image": "holiday/himoyachi"
        },
        {
            "name": "Xotira va qadrlash kuni",
            "date": "9-may",
            "description": "Ikkinchi Jahon urushi boshlangan paytda O‘zbekiston aholisi 6,5 million kishi edi. Ulug‘ Vatan urushida jami 1.4 mln.ga yaqin o‘zbekistonlik (aholining 22%) qatnashdi. Yurtdoshlarimiz butun kuchi va imkoniyatlarini qisqa muddat ichida O‘zbekistonga evakuatsiya qilingan 100 dan ortiq zavod va fabrika faoliyatini yo‘lga qo‘yishga safarbar qildi. Urush yillarida respublikamizdan frontga 2 mingdan ortiq samolyot, katta miqdorda tanklar, qurol-yarog‘, harbiy-sanitar poezdlar, dala oshxonalari, palatkalar, oziq-ovqat mahsulotlari va kiyim-kechak yetkazib berildi. 120 mingdan ortiq o‘zbekistonlik askar va zobitlar ko‘rsatgan jasorati va qahramonligi uchun orden va medallar bilan taqdirlandi. Ulardan 301 nafari Sovet Ittifoqi Qahramoni unvoniga, 74 nafari – uch darajali Shuhrat ordeniga sazovor bo‘ldi. Shu kuni Ikkinchi Jahon urushi qatnashchilarining xotirasi yod etiladi. Motamsaro Ona haykali poyiga gullar qo‘yiladi, Qardosh qabrlar memoriali ziyorat qilinadi. 2020-yilda Toshkentning Olmazor tumanida mavzuli G‘alaba bog‘i va muzey ochildi. Bog‘ harbiy yillar uslubida jihozlangan, unda okoplar va blindajlar, dala oshxonalari va o‘sha yillarning boshqa elementlarini ko‘rish mumkin. Ochiq osmon ostida harbiy texnika va qurol-yarog‘lar ko‘rgazmasi taqdim etilgan.",
            "image": "holiday/xotira"
        },
        {
            "name": "Mustaqillik Kuni",
            "date": "1-sentabr",
            "description": "Mustaqillik Kuni O‘zbekistonning asosiy milliy bayrami hisoblanadi. 1991-yil 31-avgust kuni O‘zbekiston SSR Oliy Kengashining navbatdan tashqari sessiyasida Toshkentda \"O‘zbekiston Respublikasi davlat mustaqilligi e’lon qilinishi to‘g‘risida\" qaror va \"O‘zbekiston Respublikasi davlat mustaqilligi asoslari to‘g‘risida\" qonun qabul qilindi. Qarorda O‘zbekiston SSR O‘zbekiston Respublikasi deb qayta nomlanishi belgilandi. 1992-yili ilk bor Mustaqillik kuni nishonlandi. Butun respublika Mustaqillik kunini keng va shodon nishonlaydi. O‘zbekistonning har bir viloyatida o‘z bayram dasturi tayyorlanadi. Shu kuni qaerda bo‘lishingizdan qat’i nazar, sizni qiziqarli tomoshalar kutadi: o‘ziga xos folklor jamoalarning chiqishlari, quvnoq sport musobaqalari, estrada shousi, xalq hunarmandlarining shovqin-suronli yarmarkalari. Va, albatta, shirinliklar va taomlarsiz qanday bayram bo‘lishi mumkin? Shu kuni bayram palovi – bu markaziy taom, oilalar, hamkasblar, qo‘shnilar, do‘stlar to‘kin-sochin dasturxon atrofida to‘planadi. O‘zbekiston poytaxtida esa tantanalarga oldindan tayyorgarlik ko‘riladi, chunki bayram shousi shu darajada yorqin va ko‘lamli-ki, kishini hayratda qoldiradi. Unda yuzlab statistlar, musiqiy va raqs jamoalari, estrada va kinoning yorqin yulduzlari qatnashadi. Kechki paytda esa maydon uzra ajoyib bayram mushakbozligi yuz beradi.",
            "image": "holiday/mustaqillik"
        },
        {
            "name": "O‘qituvchilar va Murabbiylar kuni",
            "date": "1-okyabr",
            "description": "Prezident Islom Karimovning 1996-yil 27-dekabrdagi Farmoniga ko‘ra, bu bayram O‘zbekistonda 1997-yildan buyon nishonlanib kelinadi. O‘shanja o‘zining o‘qituvchilar va ustozlarga bayram murojaatida O‘zbekiston rahbari ularning mehnatini juda yuqori baholadi, har bir o‘qituvchining mehnati murakkabligi va muhimligini qayd etdi hamda ularga \"o‘z bilimi va tajribasini, iste’dodi va mahoratini, qalb mehrini, kuch-quvvatini ayamasdan, eng yaxshi insoniy fazilatlarni namoyon qilgan holda, ta’lim-tarbiya va ma’rifatparvarlik ishiga butun borlig‘ini berib xizmat qilib kelayotgani uchun\" minnatdorchilik bildirdi. Respublikada ta’lim tizimini muntazam takomillashtirishga, o‘quv muassasalarini qurish, rekonstruksiya qilishga, maktabgacha ta’lim muassasalari tizimini kengaytirishga, umumiy o‘rta ta’lim sifatini tubdan yaxshilashga alohida e’tibor qaratiladi. Ushbu sohada qabul qilinayotgan qonun hujjatlari asosida ta’lim sifatini oshirish, yuqori malakali kadrlarni tayyorlash, maktabgacha ta’lim va maktab ta’limi muassasalari tarmog‘ini kengaytirish, ularda bolalarning har tomonlama rivojlanishi uchun sharoitlarni yaxshilash bo‘yicha izchil ishlar amalga oshirilmoqda. O‘zbekiston Respublikasi Xalq ta’limi vazirligi tomonidan pedagoglarning kasb mahoratini oshirishga yo‘naltirilgan ma’rifiy loyihalar, ijodiy tanlovlar, o‘qituvchilar uchun konferentsiyalar o‘tkaziladi. \"Yilning eng yaxshi o‘qituvchisi\", \"Yilning eng yaxshi maktabi\", \"Yilning eng yaxshi ruhshunosi\", \"Yilning eng yaxshi tarbiyachisi\" tanlovlari sohada ilg‘or tajribani ommalashtirish, o‘qituvchilarni har tomonlama qo‘llab-quvvatlashning muhim omili hisoblanadi. Shu kuni o‘quvchilar, talabalar va umuman, mamlakatning butun aholisi barcha ta’lim muassasalarining o‘qituvchilarini, ustozlarini va murabbiylarini eng ahamiyatli va tantanali bayramlardan biri hisoblangan kasb bayrami bilan tabriklaydi. O‘zbekistonda o‘qituvchilar va murabbiylarga nisbatan munosabat doim o‘zgacha bo‘lgan. Bugun ham ushbu kasb sohiblarini avvalgiday juda hurmat qilishadi, ularning mehnatini va o‘sib kelayotgan avlod haqidagi fidokorona g‘amxo‘rligini juda qadrlashadi.",
            "image": "holiday/oqituvchi"
        },
        {
            "name": "Konstitutsiya kuni",
            "date": "8-dekabr",
            "description": "1992-yilning shu kuni, O‘zbekiston Respublikasi Oliy Kengashining 11-sessiyasida mamlakatning Asosiy Qonuni, mustaqil suveren davlat sifatida O‘zbekiston Konstitutsiyasi bir ovozdan qabul qilindi. Shu kunning o‘zida Respublika Prezidenti Islom Karimov \"O‘zbekiston Respublikasi Konstitutsiyasini qabul qilish to‘g‘risida\", \"O‘zbekiston Respublikasi Konstitutsiyasi qabul qilingan kunni davlat bayrami deb e’lon qilish to‘g‘risida\", \"O‘zbekiston Respublikasi Konstitutsiyasini kuchga kiritish tartibi to‘g‘risida\"gi qonunlarni imzoladi\". O‘zbekiston Konstitutsiyasi Birlashgan Millatlar Tashkiloti, Yevropada Xavfsizlik va Hamkorlik Kengashi mutaxassislari, olimlar, AQSH, Buyuk Britaniya, Fransiya va boshqa ko‘plab davlatlar ekspertizasidan o‘tgan. U demokratiyaning asosiy tamoyillarini birlashtirdi: O‘zbekiston – suveren demokratik respublika (1-modda) Davlat xalq irodasini ifoda etib, uning manfaatlariga xizmat qiladi. Davlat organlari va mansabdor shaxslar jamiyat va fuqarolar oldida mas’uldirlar (2-modda) Xalq davlat hokimiyatining birdan bir manbaidir (7-modda) O‘zbekiston xalqini millatidan qat’i nazar, O‘zbekiston Respublikasining fuqarolari tashkil etadi (8-modda) Jamiyat va davlat hayotining eng muhim masalalari xalq muhokamasiga taqdim etiladi, umumiy ovozga (referendumga) qo‘yiladi. Referendum o‘tkazish tartibi qonun bilan belgilanadi (referendum) (9-modda) Bugun mamlakatning asosiy qonuni qabul qilingan kun O‘zbekistonda milliy va umumxalq bayrami sifatida nishonlanadi. Shaharlar ko‘chalari bayroqlar bilan bezatiladi va mamlakat poytaxtida shu sanaga bag‘ishlangan turli xil bayram tadbirlari-estrada yulduzlarining konsertlari, ko‘rgazmalar, ma’rifiy tadbirlar, sport va xayriya tadbirlari, har xil shoular o‘tkaziladi...",
            "image": "holiday/konstitutsiya"
        },
        {
            "name": "Ro‘za hayiti (Iyd al-Fitr)",
            "date": "2022-yilda 3-mayda boshlanadi",
            "description": "Milliy diniy bayramlar orasida barcha musulmonlar tomonidan ulug‘lanadigan ro‘za hayiti bayrami tantanasi nishonlanadi. Bu, shuningdek, ro‘za oyi sifatida ham tanilgan – muqaddas Ramazon oyining tugashiga to‘g‘ri keladi va shu bilan birga ro‘za nihoyasiga yetadi. U Shavvol oyining birinchi kunida nishonlanadi. Ramazon hayitining arabcha nomi Iyd al-Fitr ro‘za tutish tugashining bayramidir. Bu kun arafasida dindorlar ro‘za tutishning qoidalariga rioya qilishlari, o‘zlarini ham ma’naviy, ham jismonan butunlay tozalash, faqat inoyatga to‘lgan his-tuyg‘ularni namoyon etish, xushmuomala va kamtar bo‘lish va dunyoga yaxshilik olib kelishlari kerakligini unutmasliklari kerak. Bayram arafasida va kuni majburiy sadaqalar yig‘iladi – fitr zakoti. Yig‘ilgan mablag‘lar kambag‘allarga, musofirlarga va boshqalarga oziq-ovqat mahsulotlari yoki bu mahsulotlarning pul ekvivalenti ko‘rinishida ketadi. Bayram kuni musulmonlar bayramona marosim namozini o‘qiydilar, eng yaxshi kiyimlarni kiyadilar, an’anaviy taomlarni tayyorlaydilar va bayram namozidan keyin bayram dasturxoni yozadilar, qo‘shnilarini, qarindoshlarini va do‘stlarini mehmonga taklif qiladilar, sovg‘alar bilan mehmonlarni qaytaradilar, xursandchilik qiladilar va shodlanadilar. Barcha musulmonlar uchun quvonchli bayramda bolalar turli o‘yinlarda qatnashadilar, ularga shirinliklar tarqatadilar qo‘ni-qo‘shnilarinikiga o‘tadilar,. Bu vaqtda kambag‘allarga xayr-ehson tarqatish, sovg‘alar berish va bir-biridan kechirim so‘rash odat tusiga kiradi.",
            "image": "holiday/rozahayt"
        },
        {
            "name": "Qurbon hayiti (Iyd al-Adha)",
            "date": "2022-yilda 10-iyulda nishonlandi",
            "description": "Qurbon hayiti, Ro‘za hayitidan 70 kun o‘tgach, zulhijja oyining 10-kunida nishonlanadigan haj marosimining tugashi bayrami sifatida tanilgan. Musulmonlar shu kuni Ibrohim payg‘ambarning qurbonligini eslaydilar, masjidlarga boradilar va kambag‘allarga va ochlarga xayr-ehson tarqatadilar. Bu asosiy diniy bayramlardan biri bo‘lib, musulmonlarga insonning Xudoga bo‘lgan sadoqatini va qudratli Tangrining rahmatini eslatadi. Qur’onga ko‘ra, Jabroil farishta Ibrohimga tushida ko‘rinib, unga Ollohdan o‘g‘lini qurbon qilishga buyruq bergan. Afsonada katta o‘g‘il nomi Ismoil deb ataladi. Ibrohim Mino vodiysiga aytilgan joyga boradi (hozirda Makka o‘sha yerda) va tayyorgarlikni boshlaydi. Buni bilgan o‘g‘li qarshilik qilmaydi, balki otasiga va Ollohga bo‘ysungani uchun yig‘lab, ibodat qiladi. Ammo qurbonlik vaqti deyarli kelganida, Olloh pichoqni Ismoilni so‘ya olmaydigan qilib qo‘yadi. Qurbonlik qo‘yga almashtiriladi, Ibrohimga esa Ishoq (Isaak) nomli ikkinchi o‘g‘il tavalludi hadya etiladi. Qurbon hayiti bayramining arabcha nomi Iyd al-Adha \"qurbonlik bayrami\" deb tarjima qilinadi. O‘zbek tilida Qurbon hayiti deb ataladi. Musulmon urf-odatlarida, odamni Ollohga yaqinlashtiradigan hamma narsa qurbonlik deb ataladi va bayramda hayvonni so‘yish marosimi Ollohga ruhiy murojaat qilishni nazarda tutadi. Qurbon hayitini nishonlashda musulmonlar to‘liq tahorat olib, toza va bayramona kiyim kiyishlari kerak. Ular bayram takbirini o‘qiydilar, buni ertalab masjid tomon yurish paytida takrorlash kerak. Masjidda bayram namozi o‘qiladi, shundan so‘ng xutba va’zi o‘qiladi. Odatda Olloh va Muhammadni ulug‘lashdan boshlanadi, so‘ngra hajning kelib chiqishi va qurbonlik marosimining ma’nosi tushuntiriladi. Qurbon qo‘chqor, tuya yoki sigir bo‘lishi mumkin. Qurbonlikka keltiriladigan hayvon kamida olti oylik bo‘lishi, sog‘lom bo‘lishi va hech qanday nuqsoni bo‘lmasligi kerak. Urf-odat, agar vasiyat qilingan bo‘lsa, o‘liklar nomidan qurbonlik keltirishga ruxsat beradi. Bitta oiladan bitta qo‘y so‘yiladi. Qurbonlik kuni bayram bilan bir-birlarini ziyorat qilish va tabriklash odat tusiga kiradi.",
            "image": "holiday/qurbonhayt"
        }
    ]
}